{
    "data": [
        {
            "course_id": "013702",
            "subject": "PS",
            "catalog_number": "611",
            "title": "Government, Politics and the Public Service",
            "units": 0.5,
            "description": "Public servants require a thorough understanding of Canada's political system.  This course examines the structure and functions of the Westminster system of government, upon which Canada's is based, and explores the role of the public service in relation to other fundamental institutions of Canadian governance, such as the political executive, the legislature and the judiciary.  Topics examined include the unique context of Canadian politics and public administration, the role of the federal, provincial and municipal levels of government within the Canadian federation, ministerial responsibility and accountability, and contemporary challenges facing the public service.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS611",
            "academic_level": "graduate"
        },
        {
            "course_id": "013703",
            "subject": "PS",
            "catalog_number": "612",
            "title": "Government Finance I:  Accounting and Accountability",
            "units": 0.5,
            "description": "The government work environment presents unique challenges in the realm of financial planning.  This course explores the priority-setting, resource planing, and budget allocation processes in government, giving special attention to the roles, responsibilities and accountabilities of key stakeholders.  The aim is to provide students with advanced knowledge of the government financial planning process, which will place them in a stronger position to consult with and make recommendations to management.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS612",
            "academic_level": "graduate"
        },
        {
            "course_id": "013704",
            "subject": "PS",
            "catalog_number": "613",
            "title": "The Politics of Difference in Canada:  Challenges and Policy Responses",
            "units": 0.5,
            "description": "This course introduces students to the policy challenges facing governments in a rapidly changing and increasingly diverse Canada.  A principal focus of the course is Canada's Aboriginal peoples, exploring topics such as aboriginal title and treaty rights, land claim settlements, poverty and powerlessness in cities and on reserve, debates over self-governance, and other matters that directly implicate federal, provincial and municipal governments.  The course also examines how the management of race and ethnicity is integrated into public policy and applied to the public service.  Topics may include the development and implementation of Canada's Multiculturalism program, immigration policy and politics, the principles and practices of institutional inclusion and reasonable accommodation, Employment Equity, and the dynamics of race, racism and anti-racism in Canada. This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS613",
            "academic_level": "graduate"
        },
        {
            "course_id": "013705",
            "subject": "PS",
            "catalog_number": "614",
            "title": "Communicating with Diverse Audiences",
            "units": 0.5,
            "description": "Public servants often have to become communication specialists: they have to communicate with diverse audiences (e.g. citizen groups, politicians, lawyers, parliamentary committees and subcommittees) using a variety of genres (e.g. reports, records pamphlets, power point presentations, briefs) as well as different modes of communication (e.g. electronic, text, face-to-face).  This course offers participants an opportunity to identify and interrogate the stylistic and visual strategies characteristic of the documents in their workplaces.  Much of the course focuses on identifying the needs of different audiences and aligning stylistic and visual choices to those audiences.  In the process of investigating documentation practices, course participants are offered opportunities to develop their own informal and formal communication skills.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS614",
            "academic_level": "graduate"
        },
        {
            "course_id": "013706",
            "subject": "PS",
            "catalog_number": "615",
            "title": "Effective Problem-Solving and Decision-Making",
            "units": 0.5,
            "description": "Effective problem-solving requires a systematic approach, which involves critical analysis to identify problem causes and consequences, creativity and resourcefulness in developing potential solutions, sound judgement in selecting an optimal course of action, and thorough planning to implement and evaluate the selected approach.  In this course, students work through decision-making scenarios drawn from government to analyze problems, identify causes, assess options and develop solutions. This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS615",
            "academic_level": "graduate"
        },
        {
            "course_id": "013707",
            "subject": "PS",
            "catalog_number": "616",
            "title": "Spoken French in Context",
            "units": 0.5,
            "description": "Some public service positions require proficiency in both of Canada's official languages, English and French.  This optional course is taught at an intermediate level, and is designed to refresh and reinforce linguistic skills students have acquired through previous French language training (e.g. senior high school or university courses).  It aims to strengthen proficiency in oral expression and comprehension, through the study of specialized vocabulary and situational learning scenarios, such as role-play exercises.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS616",
            "academic_level": "graduate"
        },
        {
            "course_id": "013708",
            "subject": "PS",
            "catalog_number": "617",
            "title": "Values and Ethics in Government",
            "units": 0.5,
            "description": "Exemplary public service is founded on a commitment to values and ethics.  Using the Values and Ethics Code for the Public Service as a guidebook, this course will first provide a broad overview of issues related to values and ethics, followed by a more specific examination of how values and ethics inform government policy planning, decision making, and service delivery.  Case studies drawn from government will be examined and discussed, and issues such as workplace diversity, confidentiality, and conflict of interest will be addressed.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS617",
            "academic_level": "graduate"
        },
        {
            "course_id": "013709",
            "subject": "PS",
            "catalog_number": "618",
            "title": "Public Policy Development",
            "units": 0.5,
            "description": "Public servants are often involved in the development, implementation and evaluation of public policy.  This course examines the dynamics of public policy development in Canada, analyzing the actors, interests and institutions involved in problem identification, policy design, decision-making, implementation and evaluation.  It is designed to equip students with knowledge of the policy process and a framework to analyze and recommend courses of action in response to contemporary problems. This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS618",
            "academic_level": "graduate"
        },
        {
            "course_id": "013710",
            "subject": "PS",
            "catalog_number": "619",
            "title": "Government Finance II: Practices and Procedures",
            "units": 0.5,
            "description": "This course focuses on developing skills and hands-on familiarity with a range of government financial practices and procedures.  Topics covered may include audit management (audit reports; audit planning in municipal, provincial, and federal settings; risk assessment and management, and so on), work planning and budgeting (performing planning, analysis and control tasks; coordinating the work plan and budget process; and drafting effective guidelines and directives), and Request for Proposal (RFP) management, (developing requirements; evaluating proposals; writing contracts).  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS619",
            "academic_level": "graduate"
        },
        {
            "course_id": "013711",
            "subject": "PS",
            "catalog_number": "620",
            "title": "Effective Leadership and Management",
            "units": 0.5,
            "description": "An effective leader demonstrates mastery of skills in four key domains:  personal, interpersonal, organizational, and contextual.  Using these four areas as a guide, this course offers future public servants a comprehensive interactive program aimed at developing their skills as managerial leaders.  Case studies drawn from government are examined and role-playing and problem-solving exercises are used to cultivate leadership capacity.  Students explore the roles of values and ethics in the life of a public servant, the need to build community and foster a culture of collaboration, and the necessity of being an effective communicator and leader of people.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS620",
            "academic_level": "graduate"
        },
        {
            "course_id": "013712",
            "subject": "PS",
            "catalog_number": "621",
            "title": "Project Management in Government",
            "units": 0.5,
            "description": "Project management - the coordination of people, processes, and information to achieve desired goals - is a core competency required of public servants.  This course provides students with training in the key elements of effective project management, including team building, priority setting, scheduling, resource management, communication, and project implementation and completion.  Examples of projects taken from government are used both as case studies for analysis and for hands-on project management exercises aimed at honing skills.  Because information management is a fundamental part of most government projects, the course explores tools, methodologies, and guidelines surrounding the access, evaluation, and use of government information. This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS621",
            "academic_level": "graduate"
        },
        {
            "course_id": "013713",
            "subject": "PS",
            "catalog_number": "622",
            "title": "Major Team Project",
            "units": 1,
            "description": "In this course, teams of three or four students propose, research and write a major report on a topic that may arise from their co-op work term experience, coursework, or mutual interest in a particular salient, contemporary public issue.  Teams are responsible for organizing regular meetings to coordinate work tasks, keeping a record of individual contributions to the project and producing a professional, thorough analysis which demonstrates the knowledge and skills they have acquired in the MPS program.  This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS622",
            "academic_level": "graduate"
        },
        {
            "course_id": "014427",
            "subject": "PS",
            "catalog_number": "623",
            "title": "Government, Business and Civil Society",
            "units": 0.5,
            "description": "Public service work frequently involves ineractions wtih various levels of government, business, and civil society.  This course aims to help students develop critical analysis skils to assess the resources and interests of stakeholders and to understand tensions among them.  Drawing on political economy and social movement theory, the course examines several major current debates. Topics may include healthcare and social policy, inequality and poverty, environmental issues, and economic development.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS623",
            "academic_level": "graduate"
        },
        {
            "course_id": "014428",
            "subject": "PS",
            "catalog_number": "624",
            "title": "Research Methods and Data Analysis",
            "units": 0.5,
            "description": "To effectively support evidence-based decision making, public servants must be skilled in collective, analyzing, interpreting and presenting data.  This course explores the principles and practices of effective research design, and equips students with essential skills in data collection and analysis.  Topics may include methods of data collection, measurement, data coding, descriptive and inferential statistics, sampling, survey research techniques, questionnaire design, interviews, and research ethics.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS624",
            "academic_level": "graduate"
        },
        {
            "course_id": "014189",
            "subject": "PS",
            "catalog_number": "699",
            "title": "Special Topics",
            "units": 0.5,
            "description": "This course, which may be offered periodically in place of one of the required program courses, addresses special topics related to government and public service. This course is restricted to students enrolled in the Master of Public Service program.",
            "instructions": [
                "LEC",
                "SEM",
                "TUT"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only",
                "1   Understanding Political Enviro"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS699",
            "academic_level": "graduate"
        },
        {
            "course_id": "014734",
            "subject": "PS",
            "catalog_number": "625",
            "title": "Economics and Public Policy I",
            "units": 0.5,
            "description": "This course teaches students fundamental principles of microeconomics with an emphasis on cost-benefit analysis.  Topics covered may include demand and supply, pareto-efficiency, surplus and deadweight loss, discounting, time-stream evaluation and investment criteria, the measurement of welfare change, shadow prices, and the valuation of intangibles.  In order to ensure policy relevance, Treasury Board of Canada guidelines are used as a template for cost-benefit analysis techniques.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS625",
            "academic_level": "graduate"
        },
        {
            "course_id": "014741",
            "subject": "PS",
            "catalog_number": "626",
            "title": "Economics and Public Policy II",
            "units": 0.5,
            "description": "This course focuses on the rationale for government intervention in a market economy.  The course begins with a consideration of market successes through the analysis of the first and second theorems of welfare economics.  The course then considers market failures through an analysis of distributional issues, public goods, externalities, non-competitive market structures, and asymmetric information.  The role and degree of government intervention in health care, education, social assistance, employment insurance, and pension plans is also discussed.",
            "instructions": [
                "SEM"
            ],
            "prerequisites": null,
            "antirequisites": null,
            "corequisites": null,
            "crosslistings": null,
            "terms_offered": [],
            "notes": null,
            "offerings": {
                "online": false,
                "online_only": false,
                "st_jerome": false,
                "st_jerome_only": false,
                "renison": false,
                "renison_only": false,
                "conrad_grebel": false,
                "conrad_grebel_only": false
            },
            "needs_department_consent": false,
            "needs_instructor_consent": false,
            "extra": [
                "PS Grad Students Only"
            ],
            "calendar_year": "1617",
            "url": "http://www.ucalendar.uwaterloo.ca/SA/GRAD/1617/GRDcourse-PS.html#PS626",
            "academic_level": "graduate"
        }
    ]
}